bostang/PSoC6/Notes/ReceiveUART/main.c
// Program ReceiveUART
  // mengetikkan pada keyboard lalu mengirimkan ke devais UART
// PINOUT
	// PSoC 	<-> USB-TTL
	// -		<-> 	5V
  // -    <->   3V3
	// P9_0 (RX)		<-> 	TX
	// P9_1 (TX)		<->		RX
	// GND		<->		GND

// INCLUDE LIBRARY
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

/*******************************************************************************
* Function Name: handle_error
********************************************************************************
* Summary:
* User defined error handling function.
*
* Parameters:
*  void
*
* Return:
*  void
*
*******************************************************************************/
void handle_error(void)
{
     /* Disable all interrupts. */
    __disable_irq();

    CY_ASSERT(0);
}

/*******************************************************************************
* Function Name: main
********************************************************************************
* Summary:
* This is the main function.
* Reads one byte from the serial terminal and echoes back the read byte.
*
* Parameters:
*  void
*
* Return:
*  int
*
*******************************************************************************/
int main(void)
{
    cy_rslt_t result;
    #if defined(CY_DEVICE_SECURE)
        cyhal_wdt_t wdt_obj;
        /* Clear watchdog timer so that it doesn't trigger a reset */
        result = cyhal_wdt_init(&wdt_obj, cyhal_wdt_get_max_timeout_ms());
        CY_ASSERT(CY_RSLT_SUCCESS == result);
        cyhal_wdt_free(&wdt_obj);
    #endif

    uint8_t read_data; /* Variable to store the received character
                        * through terminal */

    /* Initialize the device and board peripherals */
    result = cybsp_init();
    if (result != CY_RSLT_SUCCESS)
    {
        handle_error();
    }

    /* Initialize retarget-io to use the debug UART port */
#ifdef XMC72_EVK
    result = cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX,
                                 CY_RETARGET_IO_BAUDRATE);

    if (result != CY_RSLT_SUCCESS)
    {
        handle_error();
    }
#else
    cyhal_uart_t uart_obj;

//    result = cy_retarget_io_init_fc(P9_1,
//                                    P9_0,
//                                    CYBSP_DEBUG_UART_CTS,
//                                    CYBSP_DEBUG_UART_RTS,
//                                    CY_RETARGET_IO_BAUDRATE);

    /* Initialize the UART configuration structure */
//    const cyhal_uart_cfg_t uart_config =
//    {
//        .data_bits = DATA_BITS_8,
//        .stop_bits = STOP_BITS_1,
//        .parity = CYHAL_UART_PARITY_NONE,
//        .rx_buffer = rx_buf,
//        .rx_buffer_size = RX_BUF_SIZE
//    };

    result = cyhal_uart_init(&uart_obj, P9_1, P9_0,NC,NC, NULL, NULL);
	#define TX_BUF_SIZE     4
    size_t tx_length = TX_BUF_SIZE;

    if (result != CY_RSLT_SUCCESS)
    {
        handle_error();
    }
#endif
    /* \x1b[2J\x1b[;H - ANSI ESC sequence for clear screen */
//    printf("\x1b[2J\x1b[;H");

//    printf("***********************************************************\r\n");
//    printf("HAL: UART Transmit and Receive\r\n");
//    printf("***********************************************************\r\n\n");
//    printf(">> Start typing to see the echo on the screen \r\n\n");
    uint8_t tx_buf[TX_BUF_SIZE] = {'1','2','3','4'};
    cyhal_uart_write(&uart_obj,(void*) tx_buf,&tx_length);

    __enable_irq();
 
    for (;;)
    {
        if (CY_RSLT_SUCCESS == cyhal_uart_getc(&uart_obj,
                                               &read_data, 0))
        {
            if (CY_RSLT_SUCCESS != cyhal_uart_putc(&uart_obj,
                                                   read_data))
            {
                handle_error();
            }
        }
        else
        {
            handle_error();
        }
    }
}

/* [] END OF FILE */
